{
  "backend/main.mo": "Motoko actor defining a contact form backend with functions to submit, retrieve, and delete contact submissions stored in a List.",
  "feature_evidence.json": "Feature evidence report documenting the replacement of ProgramsSection text with Sanskrit phrase 'धर्मो रक्षति रक्षितः'.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing components, hooks, and configuration for the Kattar Sanatani Yodha website.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark modes using saffron, terracotta, and gold theme colors.",
  "frontend/index.html": "HTML entry point for the React application with title 'Kattar Sanatani Yodha (Odisha)' and root div mount point.",
  "frontend/src/App.tsx": "Root React component rendering the HomePage within a minimal wrapper div.",
  "frontend/src/components/AboutSection.tsx": "About section component displaying mission, community, and values with icon cards and an image from public assets.",
  "frontend/src/components/ContactSection.tsx": "Contact form component with name, email, and message fields that submits to backend via useContactForm hook and displays contact information.",
  "frontend/src/components/Footer.tsx": "Footer component with organization info, quick navigation links, and attribution to caffeine.ai with UTM tracking.",
  "frontend/src/components/GetInvolvedSection.tsx": "Get Involved section displaying four participation methods with cards, featuring a 'Join Now' button linking to external membership form.",
  "frontend/src/components/Header.tsx": "Sticky header component with logo, organization name, and responsive navigation menu that scrolls to page sections. Includes mobile hamburger menu with toggle functionality.",
  "frontend/src/components/HeroSection.tsx": "Hero banner section with background image overlay, organization title, description, and two call-to-action buttons that scroll to relevant sections.",
  "frontend/src/components/ProgramCard.tsx": "Reusable card component that displays a program with an icon, title, and description with hover effects.",
  "frontend/src/components/ProgramsSection.tsx": "Programs section displaying six program cards in a responsive grid covering cultural preservation, education, community service, youth engagement, and temple support.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an ICP actor instance based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useContactForm.ts": "React Query mutation hook for submitting contact form data through the ICP actor, with automatic query invalidation on success.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "React Query hook to fetch contact form submissions from the ICP backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes using saffron, terracotta, and gold color tokens for the Sanatani organization branding.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/HomePage.tsx": "Main landing page component that composes Header, Footer, and all main sections (Hero, About, Programs, GetInvolved, Contact) into a single page layout.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color scheme using OKLCH color space (including saffron, terracotta, gold), container settings, border radius variables, animations for accordions, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking file for Kattar Sanatani Yodha (Odisha) non-profit website, documenting implemented features including homepage, about section, programs, contact form, get involved section, Indian-inspired visual design, member form integration, and logo implementation."
}