{
  "backend/main.mo": "Motoko actor defining a contact form backend with functions to submit, retrieve, and delete contact submissions stored in a List.",
  "feature_evidence.json": "Feature evidence report documenting two features for updating Header and HeroSection components to use Vite asset import syntax for the logo image.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing component structure, styling, and functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark modes, featuring warm earth tones (saffron, terracotta, gold).",
  "frontend/index.html": "HTML entry point for the Kattar Sanatani Yodha (Odisha) application that loads the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component that renders the HomePage within a minimal wrapper div.",
  "frontend/src/components/AboutSection.tsx": "About section component displaying mission, community, and values with icon cards and a community service image.",
  "frontend/src/components/ContactSection.tsx": "Contact form component with validation, backend submission via useContactForm hook, toast notifications, and contact information display.",
  "frontend/src/components/Footer.tsx": "Footer component with organization info, quick links using smooth scroll, and attribution with UTM tracking to caffeine.ai.",
  "frontend/src/components/GetInvolvedSection.tsx": "Get Involved section displaying four participation methods in cards and a call-to-action button linking to an external membership form.",
  "frontend/src/components/Header.tsx": "Sticky header component with logo, navigation menu for sections (About, Programs, Get Involved, Contact), and responsive mobile menu toggle.",
  "frontend/src/components/HeroSection.tsx": "Hero banner section with background image overlay, organization title, description, and call-to-action buttons for joining and learning more.",
  "frontend/src/components/ProgramCard.tsx": "Reusable card component that displays a program with an icon, title, and description with hover effects.",
  "frontend/src/components/ProgramsSection.tsx": "Section displaying six program cards (Cultural Preservation, Dharmic Education, Community Gatherings, Social Service, Youth Engagement, Temple Support) in a responsive grid.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useContactForm.ts": "Custom hook providing contact form submission mutation using the backend actor, with loading and error states.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Custom hook to fetch contact form submissions from the backend actor using React Query.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, defining color tokens for saffron, terracotta, and gold branding colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/HomePage.tsx": "Main page component composing Header, Hero, About, Programs, Get Involved, Contact sections, and Footer into a single-page layout.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme with sidebar, chart, and Indian-inspired colors (saffron, terracotta, gold), plus typography and animation plugins.",
  "project_state.json": "Project state tracking for Kattar Sanatani Yodha (Odisha) non-profit website with 9 implemented features including homepage, about, programs, contact, and get-involved sections; currently has a known issue with logo and background images not displaying due to incorrect Vite asset path handling."
}