{
  "backend/main.mo": "Main actor defining contact form submission storage, user profile management with role-based access control, and admin-only endpoints for viewing and deleting submissions using the AccessControl authorization system.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: admin dashboard with submissions table, search/filter functionality, CSV/JSON export, Internet Identity authentication, and routing separation between public and admin interfaces.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing setup, homepage sections with Hindi/Sanskrit content, admin dashboard components, authentication guards, and utility functions for data export and filtering.",
  "frontend/index.css": "Global Tailwind CSS configuration with custom OKLCH color system defining warm earth tones (saffron, terracotta, gold) for light and dark modes with sidebar and chart color variables.",
  "frontend/index.html": "HTML entry point with title 'Kattar Sanatani Yodha (Odisha)' that loads the React application via main.tsx module script.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with home (/) and admin (/admin) routes, wrapped in QueryClient and InternetIdentity providers with toast notifications.",
  "frontend/src/components/AboutSection.tsx": "About section component with Hindi heading, mission statement in Hindi, and three feature cards (Mission, Community, Values) with icons, displayed in a two-column grid with an image.",
  "frontend/src/components/AdminGuard.tsx": "Authentication and authorization guard component that verifies Internet Identity login and admin role via useAdminCheck hook, displaying appropriate loading, login prompt, or access denied states before rendering protected content.",
  "frontend/src/components/ContactSection.tsx": "Contact form component with name, email, and message fields that submits to backend via useContactForm hook and displays toast notifications. Includes contact information cards with icons for email, phone, and location.",
  "frontend/src/components/ExportButton.tsx": "Dropdown menu button component that exports contact submissions data as CSV or JSON files using utility functions and displays success/error toasts.",
  "frontend/src/components/Footer.tsx": "Footer component displaying organization info, quick navigation links, contact details, copyright notice, and attribution to caffeine.ai with smooth scrolling to page sections.",
  "frontend/src/components/GetInvolvedSection.tsx": "Section showcasing four ways to get involved (membership, volunteering, events, awareness) with cards and a prominent \"Become a Member\" button linking to an external form.",
  "frontend/src/components/Header.tsx": "Sticky header with logo, navigation menu (desktop/mobile), smooth scrolling to sections, and conditional admin link for authenticated admin users using Internet Identity.",
  "frontend/src/components/HeroSection.tsx": "Hero banner with background image overlay, organization title, tagline, description, and call-to-action buttons for joining or learning more with smooth scrolling.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that handles Internet Identity login/logout with loading states and clears query cache on logout.",
  "frontend/src/components/ProgramCard.tsx": "Reusable card component displaying a program with an icon, title, and description with hover effects.",
  "frontend/src/components/ProgramsSection.tsx": "Section displaying six program cards (cultural preservation, education, community, service, youth, temple support) in a responsive grid layout.",
  "frontend/src/components/SubmissionsTable.tsx": "React component that displays contact form submissions in a table with loading, error, and empty states. Shows name, email, and message columns with responsive styling.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an ICP actor instance based on Internet Identity authentication state. Initializes access control with admin token and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useAdminCheck.ts": "Custom hook that queries whether the current authenticated user has admin privileges using the actor's isCallerAdmin method.",
  "frontend/src/hooks/useContactForm.ts": "Custom hook that provides a mutation function to submit contact form data through the actor and invalidates submissions query on success.",
  "frontend/src/hooks/useInternetIdentity.ts": "Comprehensive React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle. Provides login, logout, and status tracking functionality.",
  "frontend/src/hooks/useQueries.ts": "Custom hook that fetches contact form submissions from the backend actor, only enabled when authenticated and actor is available.",
  "frontend/src/hooks/useSubmissionFilter.ts": "Custom hook that filters contact submissions by search term across name, email, and message fields with memoization for performance.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for light and dark themes, including saffron, terracotta, and gold color variables. Sets up typography with Inter font family.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page with authentication guard that displays searchable/filterable submissions table and export functionality. Includes header, footer, and navigation back to home.",
  "frontend/src/pages/HomePage.tsx": "Main landing page component that composes header, footer, and multiple content sections (hero, about, programs, get involved, contact).",
  "frontend/src/utils/exportData.ts": "Utility functions to convert contact submissions to CSV or JSON format and trigger browser downloads with proper escaping and MIME types.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and functions to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, container settings, border radius variables, animations, and typography/container-queries/animate plugins.",
  "project_state.json": "Project state tracking document showing five implemented features for an admin dashboard with form submission management, authentication via Internet Identity, search/filter, export functionality, and routing separation from public pages."
}